tutorials/cfdemSolverRhoPimpleChem/Particle_in_Duct/CFD/constant/foam.inp
species
(
    O2
    CO2
);

reactions
{

}

