tutorials/cfdemSolverRhoPimpleChem/Particle_in_Duct/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverRhoPimpleChem;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.0;

maxDeltaT       1;


// ************************************************************************* //
libs (
    "libsampling.so"
    "libutilityFunctionObjects.so"
    "libOpenFOAM.so"
//"libsimpleSwakFunctionObjects.so"
//"libswakFunctionObjects.so"
//"libgroovyBC.so"
);

functions
{  
  testing
   {
      type                 writeRegisteredObject;
      functionObjectLibs   ("libIOFunctionObjects.so");
/*      outputControl        outputTime;*/
      outputControl        timeStep;
      outputInterval       1;
      objectNames
      (
         "CO2"
      );
   }
 
 CO2-Average1
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;

        fields
        (
            CO2
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
    
    // add CO2 concentration
   species_CO2 // Name also used to identify output folder 
    { 
        type            cellSource; 
        functionObjectLibs ("libfieldValueFunctionObjects.so"); 
        enabled         true; 
        outputControl   timeStep;//outputTime; 
        log             true;    
        valueOutput     false;   //true; 
        source          all;   // Type of cell source or all for the full domain
        sourceName      CO2; 
        operation       sum; // volAverage; //volIntegrate; //weightedAverage; //none;
        fields 
        ( 
            CO2
        ); 
    } 
}

// ************************************************************************* //
